{
  "nav": {
   "firstName": "Virgile",
    "lastName": "Fouche", 
    "job": "Full Stack Developer",
    "description": "Motivated computer engineering student in work-study program, balancing my passion for martial arts and music with my studies.",
    "menu": [
      { "name": "ABOUT", "href": "#about" },
      { "name": "EDUCATION", "href": "#experience" },
      { "name": "EXPERIENCE", "href": "#projects" }
    ]
  },
  "about": {
    "title": "About Me",
    "korokSeeds": "Korok seeds",
    "paragraphs": [
      "I'm a passionate Full Stack developer, currently in my 5th year of computer engineering studies at EPITA Paris. My journey combines solid academic training with enriching professional experience through work-study programs.",
      "Autonomous, curious, and committed, I bring my technical and human skills to the teams I work with. My expertise covers the entire development stack, with solid experience in Python, Java, JavaScript, and modern frameworks.",
      "My versatility allows me to easily adapt to different technical environments, whether developing robust APIs, creating intuitive user interfaces, or implementing high-performance DevOps solutions.",
      "Outside of development, I practice karate at the national level and perform music in concerts - two passions that bring me discipline, creativity, and stress management skills that I naturally transfer to my work as a developer."
    ]
  },
  "experiences": {
    "title": "Education",
    "list": [
      {
        "date": "2023 - 2025",
        "title": "Computer Engineering Degree . EPITA Paris",
        "description": "High-level computer engineering program with specialization in software development, system architecture, and technical project management. Curriculum focused on emerging technologies and modern development methodologies.",
        "languages": [
          "Advanced Algorithms",
          "Software Architecture",
          "Project Management",
          "Artificial Intelligence",
          "Computer Security",
          "DevOps",
          "Team Management"
        ]
      },
      {
        "date": "2022 - 2023",
        "title": "Bachelor in Application Development and Design . CESI Bordeaux",
        "description": "Professional training focused on web and mobile application development. Learning agile methodologies, application architecture design, and full-stack development with a constant project-based approach.",
        "languages": [
          "Web Development",
          "Application Design",
          "Agile Methods",
          "Databases",
          "JavaScript",
          "Python",
          "Project Management"
        ]
      },
      {
        "date": "2020 - 2022",
        "title": "Computer Science DUT . IUT La Rochelle University",
        "description": "Fundamental computer science training covering programming basics, algorithms, systems and networks. First approach to software development and databases with numerous practical projects.",
        "languages": [
          "Algorithms",
          "Programming",
          "Databases",
          "Systems and Networks",
          "C/C++",
          "Java",
          "SQL"
        ]
      }
    ]
  },
  "projects": {
    "title": "Professional Experience",
    "viewProject": "View Project",
    "github": "GitHub",
    "list": [
      {
        "title": "Full Stack Developer - Sopra Steria",
        "description": "ESN, ministry of defense department: API & front-end development for critical applications. Agile team work on large-scale projects with high security requirements.",
        "technologies": ["Java", "Spring Boot", "React JS", "REST API", "Git", "Agile"],
        "date": "2024-2025 | Work-study"
      },
      {
        "title": "Full Stack Engineer Developer - Assystem",
        "description": "Assystem, ecological transition company for buildings: Development of internal web applications to optimize energy management. Design of modern user interfaces and high-performance APIs.",
        "technologies": ["Python", "FastAPI", "JavaScript", "Vue.js", "Angular", "DevOps"],
        "date": "2023-2024 | Work-study"
      },
      {
        "title": "Full Stack Developer (Back-end focus) - Netcarbon",
        "description": "Netcarbon, ecological carbon storage startup: API development, CI/CD pipeline setup, front-end development. Contributing to ecological innovation through technology.",
        "technologies": ["Python", "FastAPI", "GCP", "GitHub Actions", "JavaScript", "VueJS", "CI/CD"],
        "date": "2022-2023 | Work-study"
      }
    ]
  }
}