{
  "nav": {
    "firstName": "Virgile",
    "lastName": "Fouche", 
    "job": "Développeur Full Stack",
    "description": "Étudiant ingénieur informatique motivé, en alternance, je concilie ma passion pour les arts martiaux et la musique avec mes études.",
    "menu": [
      { "name": "À PROPOS", "href": "#about" },
      { "name": "FORMATIONS", "href": "#experience" },
      { "name": "EXPÉRIENCES", "href": "#projects" }
    ]
  },
  "about": {
    "title": "À Propos de Moi",
    "korokSeeds": "graines de Korok",
    "paragraphs": [
      "Je suis un développeur Full Stack passionné, actuellement en 5ème année d'études d'ingénieur informatique à l'EPITA Paris. Mon parcours allie formation académique solide et expérience professionnelle enrichissante grâce à l'alternance.",
      "Autonome, curieux et investi, je mets mes compétences techniques et humaines au service des équipes dans lesquelles j'évolue. Mon expertise couvre l'ensemble de la stack de développement, avec une solide expérience en Python, Java, JavaScript et les frameworks modernes.",
      "Ma polyvalence me permet de m'adapter facilement aux différents environnements techniques, que ce soit pour le développement d'APIs robustes, la création d'interfaces utilisateur intuitives ou la mise en place de solutions DevOps performantes.",
      "En dehors du développement, je pratique le karaté au niveau national et je fais de la musique en concert, deux passions qui m'apportent discipline, créativité et gestion du stress - des qualités que je transpose naturellement dans mon travail de développeur."
    ]
  },
  "experiences": {
    "title": "Formations",
    "list": [
      {
        "date": "2023 - 2025",
        "title": "Diplôme d'Ingénieur Informatique . EPITA Paris",
        "description": "Formation d'ingénieur informatique de haut niveau avec spécialisation en développement logiciel, architecture des systèmes et gestion de projets techniques. Cursus axé sur les technologies émergentes et les méthodologies de développement modernes.",
        "languages": [
          "Algorithmique avancée",
          "Architecture logicielle",
          "Gestion de projet",
          "Intelligence artificielle",
          "Sécurité informatique",
          "DevOps",
          "Management d'équipe"
        ]
      },
      {
        "date": "2022 - 2023",
        "title": "Bachelor Développeur et Concepteur d'Applications . CESI Bordeaux",
        "description": "Formation professionnalisante orientée développement d'applications web et mobiles. Apprentissage des méthodologies agiles, conception d'architectures applicatives et développement full-stack avec une approche projet constante.",
        "languages": [
          "Développement web",
          "Conception d'applications",
          "Méthodes agiles",
          "Base de données",
          "JavaScript",
          "Python",
          "Gestion de projet"
        ]
      },
      {
        "date": "2020 - 2022",
        "title": "DUT Informatique . IUT La Rochelle Université",
        "description": "Formation fondamentale en informatique couvrant les bases de la programmation, l'algorithmique, les systèmes et réseaux. Première approche du développement logiciel et des bases de données avec de nombreux projets pratiques.",
        "languages": [
          "Algorithmique",
          "Programmation",
          "Base de données",
          "Systèmes et réseaux",
          "C/C++",
          "Java",
          "SQL"
        ]
      }
    ]
  },
  "projects": {
    "title": "Expériences Professionnelles",
    "viewProject": "Voir le Projet",
    "github": "GitHub",
    "list": [
      {
        "title": "Développeur Full Stack - Sopra Steria",
        "description": "ESN, département ministère des armées : Développement d'API & front-end pour des applications critiques. Travail en équipe agile sur des projets de grande envergure avec des exigences de sécurité élevées.",
        "technologies": ["Java", "Spring Boot", "React JS", "API REST", "Git", "Agile"],
        "date": "2024-2025 | Alternance"
      },
      {
        "title": "Développeur Ingénieur Full Stack - Assystem",
        "description": "Assystem, entreprise de transition écologique des bâtiments : Développement d'applications web internes pour optimiser la gestion énergétique. Conception d'interfaces utilisateur modernes et d'APIs performantes.",
        "technologies": ["Python", "FastAPI", "JavaScript", "Vue.js", "Angular", "DevOps"],
        "date": "2023-2024 | Alternance"
      },
      {
        "title": "Développeur Full Stack (tendance Back-end) - Netcarbon",
        "description": "Netcarbon, startup écologique de stockage de carbone : Développement d'API, mise en place de pipeline CI/CD, développement front-end. Contribution à l'innovation écologique par la technologie.",
        "technologies": ["Python", "FastAPI", "GCP", "GitHub Actions", "JavaScript", "VueJS", "CI/CD"],
        "date": "2022-2023 | Alternance"
      }
    ]
  }
}